---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
source: html/aa184ee3-146e-5cba-5ec3-2813c40ef098.htm
---
# EnergyAnalysisConstruction Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.